@extends('_layouts.layout')
@section('content')
<style scoped>
        /* consent form */
        .page-consent {
            padding: 3rem 1rem;
        }

        .consent-form {
            display: flex;
            flex-direction: column;
        }

        .consent-heard {
            text-align: center;
        }

        .form-check-label,
        .form-check-input[type="checkbox"] {
            cursor: pointer;
        }

        .form-check {
            margin: 0 1rem;
            font-size: 20px;
            margin-top: 1rem;
        }


        .form-check-input {
            width: 20px;
            height: 20px;
            border-radius: 5px;
        }

        footer {
            display: flex;
            position: fixed;
            bottom: 0;
            width: 100%;
            background-color: #fff;
            flex-direction: column;
            align-items: center;
            text-decoration: none;
        }

        .bg-form {
            /* background-color: #FFC600; */
            border: none;
            border-radius: 10px;
        }

        .w-100 {
            width: 50% !important;
        }

        .btn:disabled,
        .btn.disabled,
        fieldset:disabled .btn {
            pointer-events: none;
            opacity: 0.65;
        }

        button:not(:disabled),
        [type="button"]:not(:disabled),
        [type="reset"]:not(:disabled),
        [type="submit"]:not(:disabled) {
            cursor: pointer;
        }

        .btn {
            margin-bottom: 1rem;
            letter-spacing: -0.025rem;
            text-transform: uppercase;
            box-shadow: 0 4px 7px -1px rgba(0, 0, 0, 0.11), 0 2px 4px -1px rgba(0, 0, 0, 0.07);
            background-size: 150%;
            background-position-x: 25%;
        }
    </style>
<div class="bg-[#FCF6FF]">
    <section class="mb-24x pb-4 mb-6">
        <div class="page-consent">
            <div class="container mx-auto w-full">
                <div class="consent-form">
                    <h1 class="consent-heard text-2xl font-bold">ข้อกำหนดการใช้งาน</h1>

                    <h3 class="text-justify mt-8 text-lg font-bold">1. การยอมรับข้อตกลงการใช้งาน</h3>

                    <p class="text-justify mt-4 indent-10 text-base">การสร้างบัญชี ojo ไม่ว่าจะผ่านอุปกรณ์มือถือ
                        แอพพลิเคชั่นมือถือ หรือคอมพิวเตอร์ (เรียกรวมว่า "บริการ")
                        หมายความว่าคุณยินยอมที่จะผูกมัดตนเองตาม (1) ข้อกำหนดการใช้งาน (2)
                        นโยบายการคุ้มครองข้อมูลส่วนบุคคลนโยบายการใช้คุกกี้ เคล็ดลับเพื่อความปลอดภัย และ
                        หลักปฏิบัติของคอมมิวนิตี้ ของเรา ซึ่งแต่ละส่วนได้ถูกรวบรวมไว้เพื่อใช้อ้างอิงกับข้อตกลงฉบับนี้
                        และ (3) ข้อกำหนดใดๆ ที่คุณได้เปิดเผยและยอมรับ หากคุณซื้อฟีเจอร์ ผลิตภัณฑ์
                        หรือบริการเพิ่มเติมที่เรานำเสนอในบริการ (เรียกรวมว่า "ข้อตกลง" ฉบับนี้)
                        หากคุณไม่ยอมรับและไม่ตกลงที่จะผูกมัดตนเองตามข้อกำหนดของข้อตกลงนี้ โปรดอย่าใช้บริการนี้
                        เรามีสิทธิทำการเปลี่ยนแปลงข้อมูลในข้อตกลงนี้และในบริการเป็นครั้งคราวด้วยเหตุผลที่หลากหลาย
                        รวมถึงเพื่อให้สอดคล้องกับการเปลี่ยนแปลงหรือข้อกำหนดที่มีในกฎหมาย ฟีเจอร์ใหม่ๆ
                        หรือการเปลี่ยนแปลงในแนวปฏิบัติทางธุรกิจ ข้อตกลงเวอร์ชั่นล่าสุดจะลงประกาศไว้บนบริการ ภายใต้หัวข้อ
                        "การตั้งค่า" และคุณควรตรวจสอบเวอร์ชั่นที่เป็นปัจจุบันที่สุดอยู่เสมอ
                        เวอร์ชั่นล่าสุดคือเวอร์ชั่นที่จะมีผลบังคับใช้
                        ถ้าหากการเปลี่ยนแปลงที่เกิดขึ้นครอบคลุมการเปลี่ยนแปลงเนื้อหาที่มีผลต่อสิทธิหรือพันธะผูกมัดของคุณ
                        เราจะแจ้งให้คุณทราบล่วงหน้าอย่างน้อย 30 วันถึงการเปลี่ยนแปลงนั้นๆ
                        (เว้นแต่เราจะไม่สามารถทำได้เนื่องจากกฎหมายที่บังคับใช้) ด้วยวิธีการที่เหมาะสม
                        รวมถึงการแจ้งเตือนผ่านบริการหรือทางอีเมล
                        หากคุณยังใช้บริการต่อไปหลังจากที่การเปลี่ยนแปลงมีผลบังคับ
                        นั่นหมายถึงคุณยอมรับในข้อตกลงที่มีการแก้ไขปรับปรุง</p>

                    <h3 class="text-justify mt-4 text-lg font-bold">2. คุณสมบัติของสมาชิก</h3>

                    <p class="text-justify mt-4 indent-10 text-base">คุณไม่ได้รับอนุญาตให้สร้างบัญชี เข้าถึง
                        หรือใช้บริการหรือระบบที่มีอยู่ หากคุณไม่ตรงตามเกณฑ์ดังต่อไปนี้
                    <p class="text-justify mt-1 indent-12 text-base">• คุณมีอายุอย่างน้อย 18 ปี</p>
                    <p class="text-justify mt-1 indent-12 text-base">• คุณสามารถสร้างสัญญาผูกพันกับ ojo</p>
                    <p class="text-justify mt-1 indent-12 text-base">• คุณจะปฏิบัติตามข้อตกลงนี้ และปฏิบัติตามกฎหมาย
                        ข้อบังคับ และกฎเกณฑ์ในระดับท้องถิ่น รัฐ ประเทศ
                        และระหว่างประเทศทั้งหมดที่เกี่ยวข้อง</p>
                    <p class="text-justify mt-1 indent-12 text-base">• คุณไม่เคยถูกตัดสินว่ามีความผิดในคดีอาชญากรรม
                        หรือความผิดอาญาอุกฉกรรจ์
                        (หรือคดีอาชญากรรมที่มีความร้ายแรงในระดับใกล้เคียงกัน) อาชญากรรมทางเพศ หรือก่ออาชญากรรมใดๆ
                        ที่เกี่ยวข้องกับความรุนแรง
                        และคุณจะต้องไม่ถูกคำสั่งให้ลงทะเบียนในฐานะผู้ล่วงละเมิดทางเพศในบัญชีผู้ล่วงละเมิดทางเพศ
                        ไม่ว่ากับรัฐ รัฐบาลกลางหรือรัฐบาลท้องถิ่นใดๆ</p>
                    </p>

                    <h3 class="text-justify mt-4 text-lg font-bold">4. การแก้ไขเปลี่ยนแปลงบริการและการยกเลิกการใช้งาน
                    </h3>

                    <p class="text-justify mt-4 indent-10 text-base">
                        ojo มุ่งมั่นและให้ความสำคัญกับการปรับปรุงบริการนี้
                        รวมถึงการนำเสนอฟังก์ชั่นการใช้งานเพิ่มเติมที่น่าสนใจและมีประโยชน์แก่คุณอยู่เสมอ ซึ่งหมายความว่า
                        เราอาจเพิ่มฟีเจอร์ใหม่ๆ ของผลิตภัณฑ์ หรือเสริมประสิทธิภาพเป็นครั้งคราว
                        เช่นเดียวกับการดึงบางฟีเจอร์ออก
                        และในกรณีที่การดำเนินการดังกล่าวไม่ได้ส่งผลกระทบต่อสิทธิหรือข้อผูกมัดของคุณอย่างมีนัยยะสำคัญ
                        เราอาจไม่จำเป็นต้องแจ้งคุณล่วงหน้าก่อนที่จะกระทำการใดๆ เราอาจระงับการใช้งานทั้งหมดของบริการนี้
                        ซึ่งในกรณีดังกล่าว เราจะทำการแจ้งให้คุณทราบล่วงหน้า เว้นเสียแต่ว่าเกิดเหตุขัดข้อง เช่น
                        ข้อกังวลด้านความปลอดภัย หรือการรักษาความปลอดภัย อาจทำให้เราไม่สามารถแจ้งคุณได้ล่วงหน้า
                    </p>

                    <p class="text-justify mt-4 indent-10 text-base">
                        วิธีที่ง่ายที่สุดในการยกเลิกบัญชีของคุณคือทำตามขั้นตอนที่ระบุใน "เมนูการตั้งค่า"
                        ในบริการนี้นอกจากนี้ ยังมีวิธีการยกเลิกอื่นๆ ที่คุณสามารถเลือกใช้ได้
                        อาจยกเลิกบัญชีของคุณได้ทุกเมื่อโดยไม่ต้องแจ้งให้ทราบล่วงหน้า หาก ojo
                        เชื่อว่าคุณได้ฝ่าฝืนข้อตกลงฉบับนี้ หากคุณโดนยกเลิกบัญชีในกรณีดังกล่าว
                        คุณจะไม่มีสิทธิ์ได้รับเงินคืนการจากซื้อใดๆ สำหรับผู้ที่พำนักอยู่ในสาธารณรัฐเกาหลี
                        ยกเว้นในกรณีที่เราพิจารณาตามสมควรแล้วว่า (ก) การแจ้งให้ทราบเป็นสิ่งต้องห้ามตามกฎหมาย
                        (ตัวอย่างเช่น เมื่อการแจ้งเตือนนั้นอาจเป็นการละเมิดกฎหมาย ข้อบังคับ
                        หรือคำสั่งที่เกี่ยวข้องจากหน่วยงานกำกับดูแล หรือเป็นการประนีประนอมการสอบสวนที่กำลังดำเนินอยู่
                        ซึ่งได้รับการดำเนินการโดยหน่วยงานกำกับดูแล) หรือ (ข) การแจ้งเตือนใดๆ อาจก่อให้เกิดอันตรายต่อคุณ
                        ต่อบุคคลที่สาม ต่อ ojo และ/หรือต่อบริษัทในเครือของเรา (ตัวอย่างเช่น
                        เมื่อการแจ้งเตือนนั้นจะเป็นอันตรายต่อความปลอดภัยของบริการ)
                        เราจะแจ้งให้คุณทราบถึงเหตุผลในการดำเนินการตามขั้นตอนที่เกี่ยวข้องโดยทันที
                        หลังจากที่บัญชีถูกยกเลิกแล้ว ข้อตกลงนี้จะสิ้นสุดตามด้วย
                        ยกเว้นข้อกำหนดดังต่อไปนี้ที่จะยังคงมีผลบังคับใช้กับคุณและ ojo
                    </p>

                    <h3 class="text-justify mt-4 text-lg font-bold">5.
                        ความปลอดภัยว่าด้วยการมีปฏิสัมพันธ์กับสมาชิกคนอื่นๆ
                    </h3>

                    <p class="text-justify mt-4 indent-10 text-base">แม้ ojo
                        จะมุ่งมั่นส่งเสริมให้สมาชิกมีประสบการณ์ที่เคารพซึ่งกันและกันผ่านฟีเจอร์ต่างๆ เช่น
                        การเลือกเข้าร่วมของทั้งสองฝ่ายซึ่งจะให้สมาชิกสื่อสารกันได้เฉพาะหลังจากที่ทั้งสองฝ่ายต่างสนใจในกันและกันเท่านั้น
                        แต่ ojo ไม่ต้องรับผิดชอบต่อพฤติกรรมของสมาชิกทั้งภายในและภายนอกบริการนี้
                        คุณตกลงที่จะใช้ความระมัดระวังในการมีปฏิสัมพันธ์กับสมาชิกท่านอื่น
                        โดยเฉพาะอย่างยิ่งหากคุณตัดสินใจจะติดต่อสื่อสารนอกบริการนี้หรือนัดพบปะเป็นการส่วนตัว
                        นอกจากนี้คุณตกลงที่จะศึกษาและปฏิบัติตามเคล็ดลับเพื่อความปลอดภัยของ ojo ก่อนใช้บริการนี้
                        คุณตกลงที่จะไม่มอบข้อมูลทางการเงิน (เช่น ข้อมูลบัตรเครดิต หรือบัญชีธนาคาร) หรือโอนเงิน,
                        ส่งเงินด้วยวิธีการอื่นใดแก่สมาชิกท่านอื่น</p>

                    <p class="text-justify mt-4 indent-10 text-base">
                        คุณจะเป็นผู้รับผิดชอบต่อการมีปฏิสัมพันธ์กับสมาชิกคนอื่นแต่เพียงผู้เดียว คุณเข้าใจดีว่า ojo
                        ไม่ได้ตรวจสอบประวัติอาชญากรรมของสมาชิก และไม่ได้เก็บข้อมูลภูมิหลังใดๆ ของสมาชิก ojo
                        ไม่รับรองหรือรับประกันพฤติกรรมหรือความเข้ากันได้ของสมาชิก</p>

                    <h3 class="text-justify mt-4 text-lg font-bold">6. สิทธิที่ ojo มอบให้คุณ</h3>

                    <p class="text-justify mt-4 indent-10 text-base">ojo
                        ให้คุณในการเข้าถึงและใช้บริการแบบส่วนบุคคลได้ทั่วโลก โดยไม่มีค่าลิขสิทธิ์ และไม่สามารถโอน จำกัด
                        เพิกถอน หรือรับช่วงอนุญาตสิทธิการใช้งานได้ นี้มีวัตถุประสงค์เดียว
                        นั่นก็คือเพื่อเปิดโอกาสให้คุณได้ใช้และเพลิดเพลินกับสิทธิประโยชน์ต่างๆ ของบริการตามที่ ojo
                        ได้กำหนดและอนุญาตไว้ในข้อตกลงนี้
                        หรือคำอนุญาตให้เข้าถึงบริการจะถูกยกเลิกโดยอัตโนมัติหากคุณมีพฤติกรรมดังต่อไปนี้:</p>
                    <p class="text-justify mt-1 indent-12 text-base">• ใช้บริการนี้ หรือคอนเทนท์ใดๆ
                        ที่ประกอบในบริการนี้เพื่อวัตถุประสงค์ในเชิงพาณิชย์ โดยไม่ได้รับอนุญาตเป็นลายลักษณ์อักษร</p>
                    <p class="text-justify mt-1 indent-12 text-base">• คัดลอก ดัดแปลง ส่ง สร้างชิ้นงานลอกเลียนจาก
                        ใช้ประโยชน์จาก หรือทำสำเนาไม่ว่าด้วยวิธีการใดๆ ไม่ว่ากับส่วนประกอบที่สงวนลิขสิทธิ์ใดๆ รูปภาพ
                        เครื่องหมายการค้า ชื่อทางการค้า เครื่องหมายบริการ หรือทรัพย์สินทางปัญญาอื่นๆ เนื้อหา
                        หรือข้อมูลที่มีกรรมสิทธิ์
                        ที่สามารถเข้าถึงได้จากบริการนี้โดยไม่ได้รับการอนุญาตล่วงหน้าเป็นลายลักษณอักษรจาก ojo</p>
                    <p class="text-justify mt-1 indent-12 text-base">• แสดงออก หรือบอกเป็นนัยว่าถ้อยความใดๆ
                        ที่คุณแถลงได้รับความเห็นชอบจาก ojo</p>
                    <p class="text-justify mt-1 indent-12 text-base">• ใช้โรบอต, บอต, สไปเดอร์, ครอว์เลอร์, สเครปเปอร์,
                        แอพพลิเคชั่นค้นหาเว็บไซต์/เรียกดูข้อมูล, พร็อกซี่,
                        หรืออุปกรณ์ที่ดำเนินการด้วยตัวเองหรืออัตโนมัติอื่นๆ, วิธีการหรือกระบวนการใดๆ เพื่อเข้าถึง,
                        เรียกดู, ทำดัชนี, "ทำเหมืองข้อมูล" หรือในวิธีการใดๆ
                        ก็ตามที่เป็นการผลิตซ้ำหรือหลบเลี่ยงโครงสร้างการนำทางหรือการนำเสนอของบริการหรือคอนเทนท์ของบริการ
                    </p>
                    <p class="text-justify mt-1 indent-12 text-base">• ใช้บริการนี้ในทางใดๆ ที่อาจทำให้เกิดการแทรกแซง
                        ชะงัก หรือส่งผลกระทบทางลบต่อบริการนี้ หรือเซิร์ฟเวอร์ หรือเครือข่ายที่เชื่อมต่อกับบริการนี้</p>
                    <p class="text-justify mt-1 indent-12 text-base">• อัพโหลดไวรัส หรือโค้ดอันตราย
                        หรือไม่ว่าในกรณีอื่นใดที่อาจทำให้เกิดความสุ่มเสี่ยงด้านความปลอดภัยของบริการนี้</p>
                    <p class="text-justify mt-1 indent-12 text-base">• ปลอมแปลงหัวเว็บไซต์
                        หรือไม่ว่าในกรณีอื่นใดที่เป็นการเปลี่ยนแปลงตัวบ่งชี้ต่างๆ
                        เพื่อที่จะปิดบังแหล่งข้อมูลที่ส่งข้อมูลใดๆ ไปยังหรือผ่านบริการนี้</p>
                    <p class="text-justify mt-1 indent-12 text-base">• "เฟรม" หรือ "มิร์เรอร์"
                        ส่วนหนึ่งส่วนใดของบริการโดยไม่ได้รับการอนุญาตเป็นลายลักษณ์อักษรล่วงหน้าจาก ojo</p>
                    <p class="text-justify mt-1 indent-12 text-base">• ใช้เมต้าแท็ก (Metatag) หรือโค้ด หรืออุปกรณ์อื่นๆ
                        ที่ประกอบด้วยส่วนอ้างอิงใดๆ ถึง ojo หรือบริการนี้ (หรือเครื่องหมายการค้า ชื่อทางการค้า
                        เครื่องหมายบริการ โลโก้ หรือสโลแกนใดๆ ของ ojo) เพื่อชี้นำบุคคลใดๆ
                        ออกไปยังเว็บไซต์อื่นใดเพื่อวัตถุประสงค์ใดๆ ก็ตาม</p>
                    <p class="text-justify mt-1 indent-12 text-base">• แก้ไข ดัดแปลง ให้ช่วงสิทธิ แปล ขาย
                        เปลี่ยนแปลงทางวิศวกรรม ถอดรหัส แปลย้อนกลับ หรือไม่ว่าในกรณีอื่นใดที่เป็นการแยกส่วนใดๆ
                        ของบริการนี้ หรือเป็นต้นเหตุให้บุคคลอื่นกระทำการดังกล่าว</p>
                    <p class="text-justify mt-1 indent-12 text-base">•
                        ใช้หรือพัฒนาแอพพลิเคชั่นของบุคคลที่สามที่โต้ตอบกับบริการหรือคอนเทนท์หรือข้อมูลของสมาชิกท่านอื่นๆ
                        โดยไม่ได้รับความยินยอมเป็นลายลักษณ์อักษรล่วงหน้าจากเรา</p>
                    <p class="text-justify mt-1 indent-12 text-base">• ใช้ เข้าถึง
                        หรือเผยแพร่โปรแกรมอินเทอร์เฟซของแอพพลิเคชั่น ojo โดยไม่ได้การอนุญาตเป็นลายลักษณ์อักษร</p>
                    <p class="text-justify mt-1 indent-12 text-base">• ตรวจสอบ สแกน หรือทดสอบความไม่มั่นคงของบริการนี้
                        หรือระบบใดๆ หรือเครือข่ายของเรา</p>
                    <p class="text-justify mt-1 indent-12 text-base">• สนับสนุน หรือส่งเสริมกิจกรรมใดๆ
                        ที่ฝ่าฝืนข้อตกลงนี้</p>
                    <p class="text-justify mt-1 indent-12 text-base">• แสดงออก หรือบอกเป็นนัยว่าถ้อยความใดๆ
                        ที่คุณแถลงได้รับความเห็นชอบจาก ojo</p>
                    <p class="text-justify mt-1 indent-10 text-base">ojo อาจสืบสวนและดำเนินคดีทางกฎหมายใดๆ
                        หากมีการใช้บริการอย่างผิดกฎหมาย หรือโดยไม่ได้รับอนุญาต ซึ่งรวมถึงยกเลิกบัญชีของคุณด้วย
                        ซอฟต์แวร์ใดๆ ที่เราจัดหาไว้ให้คุณอาจจะดาวน์โหลดและติดตั้งการอัพเกรด อัพเดท หรือฟีเจอร์ใหม่ๆ
                        เองโดยอัตโนมัติ คุณมีสิทธิแก้ไขการดาวน์โหลดอัตโนมัติเหล่านี้ได้ผ่านการตั้งค่าในอุปกรณ์ของคุณ</p>

                    <h3 class="text-justify mt-4 text-lg font-bold">7. สิทธิที่คุณมอบให้ ojo</h3>

                    <p class="text-justify mt-4 indent-10 text-base">ในการสร้างบัญชีของคุณหมายความว่า
                        คุณมอบสิทธิและไลเซนส์ให้ ojo ในลักษณะที่ครอบคลุมไปทั่วโลก ถ่ายโอนได้ ให้ใช้สิทธิช่วงได้
                        ปราศจากค่าธรรมเนียมสิทธิ ที่จะโฮสต์ จัดเก็บ ใช้งาน ทำสำเนา แสดง ทำซ้ำ เปลี่ยนแปลง แก้ไข เผยแพร่
                        ดัดแปลง และแจกจ่ายข้อมูลที่คุณอนุญาตให้เราเข้าถึงจากบุคคลที่สาม เช่น จาก Facebook
                        และรวมถึงข้อมูลที่คุณโพสท์ อัพโหลด แสดง หรือทำให้เข้าถึงได้ในบริการ (เรียกรวมว่า "โพสท์")
                        หรือส่งต่อให้กับสมาชิกท่านอื่นๆ (เรียกรวมว่า "คอนเทนท์") ไลเซนส์ของ ojo
                        สำหรับคอนเทนท์ของคุณนั้นเป็นแบบไม่ผูกขาด แต่ไลเซนส์ของ ojo
                        จะเป็นแบบผูกขาดในแง่ของงานที่ถูกสร้างขึ้นผ่านการใช้บริการ ตัวอย่างเช่น ojo
                        จะมีสิทธิผูกขาดสำหรับสกรีนช็อตที่มีคอนเทนท์ของคุณอยู่</p>
                    <p class="text-justify mt-4 indent-10 text-base">นอกจากนี้เพื่อให้ ojo
                        สามารถป้องกันการใช้คอนเทนท์ของคุณนอกบริการ คุณอนุญาตให้ ojo
                        ดำเนินการในนามของคุณในแง่ของการละเมิดการใช้งานคอนเทนท์ของคุณจากบริการโดยสมาชิกท่านอื่นหรือบุคคลที่สามได้
                        ไลเซนส์ของเราในการใช้คอนเทนท์ของคุณถือเป็นสิทธิของคุณภายใต้กฎหมายที่บังคับใช้ (ตัวอย่างเช่น
                        กฎหมายที่เกี่ยวกับการคุ้มครองข้อมูลส่วนบุคคลตามขอบเขตคอนเทนท์ที่มีข้อมูลส่วนบุคคลปรากฏ
                        ตามที่กำหนดไว้ในกฎหมายเหล่านั้น) และเพื่อวัตถุประสงค์เฉพาะในการดำเนินงาน การสร้าง การจัดเสนอ
                        และการปรับปรุงบริการ รวมถึงการวิจัยและพัฒนาใหม่ๆ
                        คุณยอมรับว่าสมาชิกท่านอื่นและบุคคลอื่นที่เข้าชมหรือเข้าร่วมในบริการ (เช่น
                        บุคคลอื่นที่อาจได้รับคอนเทนท์ที่แชร์มาจากสมาชิก ojo คนอื่นๆ) สามารถดูคอนเทนท์ใดๆ
                        ที่คุณเสนอหรือที่คุณอนุญาตให้เราเสนอในบริการได้
                        คุณยอมรับว่าข้อมูลทั้งหมดที่คุณส่งมอบระหว่างการสร้างบัญชีของคุณ
                        รวมถึงข้อมูลที่มีการส่งมอบจากบัญชี ojo ของคุณ เป็นข้อมูลที่ถูกต้องและเป็นความจริง
                        และคุณมีสิทธิในการโพสท์เนื้อหาในบริการนี้ และมอบสิทธิอนุญาตให้แก่ ojo ดังที่กล่าวไว้ข้างต้น
                        คุณเข้าใจและยอมรับว่าเราอาจจะติดตาม หรือตรวจสอบเนื้อหาใดๆ ที่คุณโพสท์
                        ซึ่งถือเป็นส่วนหนึ่งของบริการนี้ เราอาจทำการลบเนื้อหาใดๆ ไม่ว่าจะทั้งหมดหรือบางส่วน
                        โดยขึ้นกับวิจารณญาณของเราแต่เพียงผู้เดียวว่ามีการละเมิดสัญญานี้
                        หรืออาจมีการทำให้เสื่อมเสียชื่อเสียงของบริการนี้ เมื่อต้องสื่อสารกับตัวแทนฝ่ายดูแลลูกค้าของเรา
                        คุณยอมรับที่จะให้ความเคารพและแสดงออกอย่างนุ่มนวล
                        หากเรารู้สึกว่าพฤติกรรมของคุณที่มีต่อตัวแทนฝ่ายดูแลลูกค้าคนใดของเราหรือพนักงานของเราเป็นการคุกคาม
                        ก่อกวน หรือก้าวร้าว ไม่ว่าในเวลาไหนก็ตาม เราขอสงวนสิทธิ์ในยกเลิกบัญชีของคุณโดยทันที เนื่องจาก
                        ojo อนุญาตให้คุณใช้บริการนี้ คุณยอมรับว่าเรา บริษัทในเครือ
                        และพันธมิตรจากบริษัทภายนอกอาจลงโฆษณาในบริการนี้ได้ โดยการส่งคำแนะนำหรือข้อติชมให้กับ ojo
                        ในเรื่องเกี่ยวกับบริการของเรา คุณยอมรับว่า ojo
                        อาจใช้หรือแชร์คำแนะนำดังกล่าวไม่ว่าจะด้วยวัตถุประสงค์ใดก็ตาม โดยไม่ต้องจ่ายค่าตอบแทนแก่คุณ</p>
                    <p class="text-justify mt-4 indent-10 text-base">โปรดทราบว่าในการทำข้อตกลงนี้กับคุณ ojo อาจเข้าถึง
                        จัดเก็บ และเปิดเผยข้อมูลบัญชีและคอนเทนท์ของคุณตามที่กฎหมายกำหนด
                        หรือกระทำด้วยความเชื่อโดยสุจริตว่า การเข้าถึง จัดเก็บ
                        หรือเปิดเผยดังกล่าวเป็นการกระทำที่ชอบด้วยกฎหมาย รวมทั้งเป็น (1) การปฏิบัติตามกระบวนการทางกฎหมาย
                        (2) การบังคับใช้ตามข้อตกลงฉบับนี้ (3)
                        การกระทำตามข้อร้องเรียนว่ามีคอนเทนท์ที่ละเมิดสิทธิของบุคคลที่สาม (4)
                        การกระทำตามคำร้องขอของคุณว่าด้วยการบริการลูกค้า หรือ (5) การปกป้องสิทธิ ทรัพย์สิน
                        หรือความปลอดภัยส่วนบุคคลของบริษัทฯ หรือบุคคลอื่น</p>

                    <h3 class="text-justify mt-4 text-lg font-bold">8. กฎของชุมชน</h3>

                    <p class="text-justify mt-4 indent-10 text-base">การตกลงใช้บริการนี้หมายความว่าคุณยินยอมที่จะไม่ :
                    </p>
                    <p class="text-justify mt-1 indent-12 text-base">• ใช้บริการนี้โดยมีวัตถุประสงค์ใดๆ ที่ขัดต่อกฎหมาย
                        หรือเป็นข้อห้ามของข้อตกลงนี้</p>
                    <p class="text-justify mt-1 indent-12 text-base">•
                        ใช้บริการเพื่อวัตถุประสงค์ที่เป็นอันตรายหรือชั่วร้ายใดๆ</p>
                    <p class="text-justify mt-1 indent-12 text-base">• ละเมิด หลักเกณฑ์ของชุมชน ของเรา
                        ซึ่งได้รับการปรับปรุงเป็นครั้งคราว</p>
                    <p class="text-justify mt-1 indent-12 text-base">• สร้างสแปม เรียกร้องเงิน หรือล่อลวงสมาชิกท่านอื่น
                    </p>
                    <p class="text-justify mt-1 indent-12 text-base">• ปลอมตัวเป็นบุคคล หรือองค์กรใดๆ หรือโพสท์รูปภาพใดๆ
                        ของบุคคลอื่นโดยไม่ได้รับอนุญาตจากบุคคลนั้น</p>
                    <p class="text-justify mt-1 indent-12 text-base">• กลั่นแกล้ง "ไล่ตาม" ข่มขู่ ทำร้ายร่างกาย คุกคาม
                        ทารุณ หรือหมิ่นประมาทบุคคลใดๆ</p>
                    <p class="text-justify mt-1 indent-12 text-base">•
                        โพสท์คอนเทนท์ที่ฝ่าฝืนหรือละเมิดสิทธิของผู้ใดผู้หนึ่ง รวมถึงสิทธิของการเผยแพร่ประชาสัมพันธ์
                        ความเป็นส่วนตัว ลิขสิทธิ์ เครื่องหมายการค้า หรือทรัพย์สินทางปัญญาหรือสิทธิในทางสัญญาอื่นๆ</p>
                    <p class="text-justify mt-1 indent-12 text-base">• โพสท์คอนเทนท์ที่เป็นคำพูดแสดงความเกลียดชัง ข่มขู่
                        เกี่ยวกับเรื่องทางเพศอย่างโจ่งแจ้ง หรือลามกอนาจาร</p>
                    <p class="text-justify mt-1 indent-12 text-base">• โพสท์คอนเทนท์ที่ก่อให้เกิดความรุนแรง
                        หรือมีภาพเปลือย มีภาพแสดงความรุนแรงหรือรูปความรุนแรงที่ไม่จำเป็น</p>
                    <p class="text-justify mt-1 indent-12 text-base">• โพสท์เนื้อหาใดๆ
                        ที่เป็นการส่งเสริมการเหยียดเชื้อชาติ คลั่งศาสนา ความเกลียดชัง หรือการทำร้ายร่างกาย
                        ไม่ว่าจะต่อกลุ่มใด หรือบุคคลใดก็ตาม</p>
                    <p class="text-justify mt-1 indent-12 text-base">• เรียกร้องขอรหัสผ่านเพื่อวัตถุประสงค์ใดๆ
                        หรือขอข้อมูลระบุตัวตนเพื่อวัตถุประสงค์ในเชิงพาณิชย์หรือวัตถุประสงค์ที่ไม่ชอบด้วยกฎหมายจากสมาชิกท่านอื่นๆ
                        หรือเผยแพร่ข้อมูลส่วนบุคคลของบุคคลอื่น โดยไม่ได้รับอนุญาตจากบุคคลนั้น</p>
                    <p class="text-justify mt-1 indent-12 text-base">• ใช้บัญชีของสมาชิกท่านอื่น
                        แชร์บัญชีกับสมาชิกท่านอื่น หรือมีมากกว่าหนึ่งบัญชี</p>
                    <p class="text-justify mt-1 indent-12 text-base">• สร้างบัญชีอื่นหลังจากที่เราปิดบัญชีของคุณไปแล้ว
                        เว้นเสียแต่ว่าคุณได้รับการอนุญาตจากเรา</p>
                    <p class="text-justify mt-1 indent-10 text-base">ojo
                        ขอสงวนสิทธิ์ในการตรวจสอบและ/หรือยกเลิกบัญชีของคุณโดยไม่คืนเงินสำหรับการซื้อใดๆ
                        หากคุณละเมิดข้อตกลงนี้ ใช้บริการในทางที่ผิด หรือประพฤติในลักษณะที่ ojo
                        เห็นว่าไม่เหมาะสมหรือผิดกฎหมาย ซึ่งรวมถึงการกระทำหรือการสื่อสารที่เกิดขึ้นทั้งในและนอกบริการ</p>

                    <h3 class="text-justify mt-4 text-lg font-bold">9. คอนเทนท์ของสมาชิกคนอื่นๆ</h3>
                    <p class="text-justify mt-4 indent-10 text-base">แม้ว่า ojo
                        จะสงวนสิทธิ์ในการตรวจสอบและลบคอนเทนท์ที่ละเมิดข้อตกลงฉบับนี้
                        คอนเทนท์ดังกล่าวถือเป็นความรับผิดชอบของสมาชิกที่ทำการโพสต์แต่เพียงผู้เดียวเท่านั้น และ ojo
                        ไม่สามารถรับประกันได้ว่าคอนเทนท์ทั้งหมดจะเป็นไปตามข้อตกลงนี้
                        หากคุณเห็นคอนเทนท์ที่ละเมิดข้อตกลงนี้</p>

                    <h3 class="text-justify mt-4 text-lg font-bold">10. การซื้อ</h3>

                    <p class="text-justify mt-4 indent-10 text-base">โดยทั่วไปแล้ว ojo
                        อาจนำเสนอผลิตภัณฑ์และบริการให้คุณซื้อเป็นครั้งคราว ("การซื้อภายในแอพ") ผ่าน App Store, Google
                        Play Store, การเรียกเก็บเงินผ่านผู้ให้บริการ, การเรียกเก็บเงินโดยตรงจาก ojo
                        หรือแพลตฟอร์มการชำระเงินอื่นๆ ที่ได้รับอนุญาตจาก ojo หากคุณทำการซื้อภายในแอพ
                        เราจะขอให้คุณยืนยันการซื้อกับผู้ให้บริการชำระเงินที่เกี่ยวข้อง
                        และจะเรียกเก็บเงินจากช่องทางชำระเงินที่คุณเลือก ไม่ว่าจะเป็นบัตรหรือบัญชีของบุคคลภายนอก เช่น
                        Google Play Store หรือ App Store ("ช่องทางชำระเงิน" ของคุณ)
                        สำหรับการซื้อภายในแอพตามราคาที่แสดงไว้สำหรับบริการที่คุณเลือก ซึ่งรวมถึงภาษีการขายหรือภาษีอื่นๆ
                        ที่คล้ายกันซึ่งอาจมีการเรียกเก็บรวมอยู่ในการชำระเงินของคุณ และคุณได้อนุญาตให้ ojo
                        หรือบัญชีบุคคลภายนอกที่เกี่ยวข้องเรียกเก็บเงินจากคุณได้</p>

                    <h3 class="text-justify mt-4 text-lg font-bold">การต่ออายุอัตโนมัติและการชำระบัตรอัตโนมัติ</h3>

                    <p class="text-justify mt-4 indent-10 text-base">
                        หากคุณสมัครสมาชิกแบบต่ออายุอัตโนมัติตามช่วงเวลาที่กำหนดโดยทำการซื้อภายในแอพ
                        ระบบจะเรียกเก็บเงินค่าสมาชิกผ่านวิธีชำระเงินของคุณโดยอัตโนมัติ จนกว่าคุณจะยกเลิกการเป็นสมาชิก
                        หลังจากพ้นระยะเวลาสมาชิกในรอบแรกแล้ว
                        ระบบจะต่ออายุสมาชิกให้คุณโดยอัตโนมัติในราคาที่คุณตกลงไว้ตอนสมัครสมาชิกจนกว่าคุณจะยกเลิกการเป็นสมาชิกก่อนวันครบกำหนดต่ออายุ
                        ระบบจะจัดเก็บข้อมูลการชำระเงินผ่านบัตรของคุณ
                        และจะนำไปใช้ในการชำระเงินอัตโนมัติผ่านบัตรใบนี้ในครั้งถัดไปตามข้อตกลง</p>
                    <p class="text-justify mt-4 indent-10 text-base">
                        กรุณาส่งคำร้องคัดค้านการชำระเงินที่เกิดขึ้นแล้วไปที่ฝ่ายบริการช่วยเหลือลูกค้าหากคุณถูกเรียกเก็บเงินโดยตรงจาก
                        ojo หรือจากบัญชีบุคคลที่สามที่เกี่ยวข้อง เช่น App Store
                        นอกจากนี้คุณยังทำการคัดค้านได้โดยการติดต่อไปยังธนาคารหรือผู้ให้บริการการชำระเงินของคุณ
                        ซึ่งสามารถให้ข้อมูลเพิ่มเติมเกี่ยวกับสิทธิของคุณรวมถึงข้อจำกัดทางด้านเวลาด้วยได้
                        คุณมีสิทธิเพิกถอนความยินยอมให้ชำระเงินผ่านบัตรโดยอัตโนมัติได้ทุกเมื่อโดยไม่มีเงื่อนไขโดยไปที่เมนูการตั้งค่าใน
                        ojo หรือบัญชีบุคคลที่สามที่เกี่ยวข้อง
                        แต่โปรดทราบว่าคุณยังต้องชำระยอดคงค้างที่เหลืออยู่ให้เสร็จสิ้น</p>
                    <p class="text-justify mt-4 indent-10 text-base">หากคุณต้องการเปลี่ยนแปลงหรือยกเลิกการเป็นสมาชิก
                        วิธีที่ง่ายที่สุดคือ เข้าสู่ระบบของบัญชีภายนอกของคุณ (หรือเมนูการตั้งค่าใน แล้วแต่กรณี)
                        และทำตามขั้นตอนการยุติหรือยกเลิกการเป็นสมาชิก แม้ว่าคุณจะได้ลบบัญชีหรือลบแอพพลิเคชั่น ojo
                        ออกจากอุปกรณ์ของคุณแล้วก็ตามการลบบัญชี ojo หรือแอพพลิเคชั่น ojo
                        จากอุปกรณ์ของคุณไม่ถือเป็นการยุติหรือยกเลิกการเป็นสมาชิกของคุณ ทาง ojo
                        จะยังคงเรียกเก็บเงินทั้งหมดจากวิธีการชำระเงินของคุณ จนกว่าคุณจะยุติหรือยกเลิกการเป็นสมาชิกบน ojo
                        หรือบัญชีภายนอก แล้วแต่กรณี เมื่อคุณยุติหรือยกเลิกการเป็นสมาชิก
                        คุณยังมีสิทธิ์ใช้บริการสมาชิกได้จนกว่าจะสิ้นสุดอายุสมาชิกปัจจุบัน
                        และระบบจะไม่ต่ออายุสมาชิกหลังจากระยะเวลาสมาชิกปัจจุบันสิ้นสุดลง</p>
                    <p class="text-justify mt-4 indent-10 text-base">อาจมีการบังคับใช้ข้อกำหนดเพิ่มเติมหากคุณชำระเงินกับ
                        ojo โดยตรงด้วยวิธีการชำระเงินของคุณหากคุณชำระเงินกับ ojo โดยตรง ojo
                        มีสิทธิแก้ไขข้อผิดพลาดเรื่องการเรียกเก็บเงินหรือข้อผิดพลาดอื่นๆ ที่ปรากฏได้
                        แม้ว่าจะได้เรียกเก็บหรือได้รับการชำระเงินนั้นไปแล้วก็ตามหากคุณเริ่มดำเนินการปฏิเสธการชำระเงินหรือขอเรียกการชำระเงินคืนผ่านวิธีการชำระเงินของคุณ
                        ojo อาจยกเลิกบัญชีของคุณได้ทันทีตามดุลยพินิจของบริษัทฯ แต่เพียงผู้เดียว</p>
                    <p class="text-justify mt-4 indent-10 text-base">คุณมีสิทธิแก้ไขข้อมูลวิธีการชำระเงินได้โดยเข้า ojo
                        และไปที่เมนูการตั้งค่า หากการชำระเงินนั้นยังไม่เสร็จสิ้น เนื่องจากบัตรหมดอายุ วงเงินไม่เพียงพอ
                        หรือด้วยเหตุอื่นใด และคุณไม่ได้ทำการแก้ไขข้อมูลวิธีการชำระเงิน ยุติ หรือยกเลิกการเป็นสมาชิก
                        ให้ถือว่าคุณยังคงต้องรับผิดชอบต่อยอดเงินที่ยังไม่ได้เรียกเก็บ และอนุญาตให้บริษัทฯ
                        ดำเนินการเรียกเก็บเงินตามวิธีการชำระเงินต่อไป เนื่องจากอาจมีการอัพเดทข้อมูลดังกล่าว
                        ซึ่งอาจส่งผลให้มีการเปลี่ยนแปลงวันที่ในเรียกเก็บเงินได้ นอกจากนี้คุณยังอนุญาตให้บริษัทฯ
                        ขอวันหมดอายุใหม่หรือวันหมดอายุและหมายเลขบัตรเครดิตหรือเดบิตใบใหม่ที่ออกให้โดยผู้ออกบัตรเครดิตหรือบัตรเดบิตของคุณ
                        เงื่อนไขในการชำระเงินของคุณจะขึ้นอยู่กับวิธีการชำระเงิน
                        และอาจถูกกำหนดโดยข้อตกลงระหว่างคุณและสถาบันการเงิน ผู้ออกบัตรเครดิต
                        หรือผู้ให้บริการอื่นตามวิธีการชำระเงินที่คุณกำหนด หากคุณพำนักนอกทวีปอเมริกา
                        เราถือว่าคุณยินยอมให้ดำเนินการชำระเงินให้ ojo
                        ไอเท็มเสมือนจริง บางครั้งคุณอาจมีสิทธิซื้อหรือรับไลเซนส์ที่จำกัด ในลักษณะที่ถ่ายโอนไม่ได้
                        ให้ใช้สิทธิช่วงไม่ได้ แต่เพิกถอนได้เพื่อใช้ "ไอเท็มเสมือนจริง"
                        ซึ่งอาจรวมถึงผลิตภัณฑ์เสมือนจริงหรือ "Coins" เสมือนจริง หรือไอเท็มอื่นๆ
                        ซึ่งสามารถแลกเปลี่ยนเป็นผลิตภัณฑ์เสมือนจริงอื่นๆ (รวมเรียกว่า "ไอเท็มเสมือน") ได้ภายในบริการ
                        ยอดคงเหลือของไอเท็มเสมือนจริงที่ปรากฏอยู่ในบัญชีของคุณไม่ถือเป็นยอดคงเหลือในโลกจริง
                        และไม่ได้สะท้อนถึงมูลค่าที่ถือไว้ แต่ถือเป็นหน่วยวัดขอบเขตของไลเซนส์การใช้งานของคุณ
                        ไม่มีการเรียกเก็บค่าธรรมเนียมสำหรับไอเท็มเสมือนจริงหากไม่มีการใช้งาน
                        อย่างไรก็ตามไลเซนส์การใช้งานที่มอบให้คุณในไอเท็มเสมือนจริงนั้นจะยุติลงตามเงื่อนไขที่ระบุไว้ในข้อตกลงนี้
                        คือเมื่อ ojo ยุติการให้บริการ หรือในกรณีที่บัญชีของคุณถูกปิดหรือยกเลิก ojo
                        ขอใช้ดุลยพินิจแต่เพียงฝ่ายเดียวในการสงวนสิทธิ์การเรียกเก็บค่าธรรมเนียมสำหรับสิทธิในการเข้าถึงหรือใช้ไอเท็มเสมือนจริง
                        และอาจแจกจ่ายไอเท็มเสมือนจริงโดยเรียกหรือไม่เรียกเก็บค่าใช้จ่ายก็ได้ ojo มีสิทธิจัดการ กำกับ
                        ควบคุม เปลี่ยนแปลง หรือยกเลิกไอเท็มเสมือนจริงเมื่อใดก็ได้
                        และจะไม่รับผิดชอบต่อคุณหรือบุคคลที่สามในกรณีที่ ojo ใช้สิทธิดังกล่าว
                        ไอเท็มเสมือนจริงใช้ได้ผ่านบริการนี้เท่านั้น
                        การซื้อและการแลกใช้ไอเท็มเสมือนจริงทั้งหมดที่กระทำผ่านบริการนี้ถือเป็นที่สิ้นสุด
                        และไม่สามารถขอเงินคืนได้
                        ข้อกำหนดของไอเท็มเสมือนจริงเพื่อใช้ในบริการนี้เป็นบริการที่จะออกผลบังคับใช้
                        ทันทีที่มีการยอมรับการซื้อไอเท็มเสมือนจริงดังกล่าว คุณรับทราบว่า ojo
                        ไม่จำเป็นต้องคืนเงินในส่วนที่เกี่ยวกับไอเท็มเสมือนจริงไม่ว่าจะด้วยเหตุผลใด
                        และคุณจะไม่ได้รับเงินหรือค่าชดเชยอื่นสำหรับไอเท็มเสมือนจริงที่ไม่ได้ใช้เมื่อปิดบัญชี
                        ไม่ว่าบัญชีดังกล่าวจะถูกปิดด้วยความสมัครใจหรือไม่ก็ตาม</p>
                    <p class="text-justify mt-4 indent-10 text-base">การคืนเงิน
                        โดยทั่วไปแล้วคุณจะไม่สามารถขอเงินคืนได้สำหรับทุกค่าใช้จ่ายสำหรับการซื้อ
                        และจะไม่มีการคืนเงินหรือเครดิตคืนให้สำหรับช่วงเวลาที่ใช้ไปบางส่วน
                        เราอาจจะยกเว้นให้ได้หากมีการยื่นคำขอให้คืนเงินการบอกรับเป็นสมาชิกนั้นภายในสิบสี่วันหลังจากวันที่ทำธุรกรรม
                        หรือหากกฎหมายในเขตอำนาจศาลของคุณกำหนดให้ต้องคืนเงิน</p>
                    <p class="text-justify mt-4 indent-10 text-base">วิธีการขอเงินคืน: หากคุณทำการซื้อผ่าน Apple ID
                        ของคุณ ทาง Apple จะเป็นผู้จัดการเรื่องการคืนเงิน ไม่ใช่ ojo โดยคุณสามารถขอเงินคืนได้โดยไปที่ App
                        Store คลิกที่ Apple ID ของคุณ จากนั้นเลือก "ประวัติการซื้อ" ค้นหาการชำระเงินนั้น และเลือก
                        "รายงานปัญหา" ในกรณีที่คุณทำการซื้อโดยใช้บัญชี Google Play Store หรือผ่าน ojo โดยตรง
                        โปรดติดต่อฝ่ายบริการช่วยเหลือลูกค้า พร้อมด้วยหมายเลขคำสั่งซื้อของคุณสำหรับ Google Play Store
                        (ข้อมูลนี้อยู่ในอีเมลยืนยันการสั่งซื้อ)
                        คุณสามารถส่งหรือจัดส่งคำร้องพร้อมลงลายมือชื่อและวันที่ได้เช่นกัน
                        โดยระบุว่าคุณในฐานะผู้ซื้อต้องการยกเลิกข้อตกลงนี้ หรือด้วยข้อความในลักษณะคล้ายคลึงกัน
                        โปรดระบุที่อยู่อีเมลหรือหมายเลขโทรศัพท์มือถือที่ผูกกับบัญชีของคุณ
                        หากคุณทำการซื้อผ่านทางแพลทฟอร์มการชำระเงินที่ไม่ได้ระบุไว้ข้างต้น
                        โปรดขอเงินคืนโดยตรงจากผู้ขายซึ่งเป็นบุคคลที่สามที่คุณทำการสั่งซื้อ</p>
                    <p class="text-justify mt-4 indent-10 text-base">
                        คุณไม่สามารถยกเลิกคำสั่งซื้อสำหรับการส่งมอบคอนเทนท์ทางดิจิทัลที่ไม่ได้ส่งมอบบนสื่อบันทึกทางกายภาพได้
                        หากกระบวนการคำสั่งได้เริ่มขึ้นแล้วโดยได้รับคำยินยอมและการรับทราบของคุณล่วงหน้าอย่างชัดแจ้งแล้วว่าคุณจะเสียสิทธิในการยกเลิก
                        ข้อกำหนดนี้มีผลบังคับใช้กับการซื้อไอเท็มเสมือนด้วย
                        ซึ่งหมายความว่าการซื้อดังกล่าวเป็นที่สิ้นสุดและไม่สามารถคืนเงินได้การกำหนดราคา ojo
                        ดำเนินธุรกิจไปทั่วโลกและราคาของเราแตกต่างกันไปในแต่ละประเทศตามปัจจัยหลายประการ
                        บ่อยครั้งที่เราจะเสนอราคาโปรโมชั่น ซึ่งอาจแตกต่างกันไปตามภูมิภาค ระยะเวลาของการสมัครเป็นสมาชิก
                        ข้อเสนอรวมหลายรายการ ฯลฯ นอกจากนี้เรายังทดสอบฟีเจอร์ใหม่ๆ และตัวเลือกการชำระเงินอื่นๆ เป็นประจำ
                    </p>


                    <h3 class="text-justify mt-4 text-lg font-bold">11.
                        การบอกกล่าวและวิธียื่นคำร้องเรื่องการละเมิดลิขสิทธิ์</h3>

                    <p class="text-justify mt-4 indent-10 text-base">
                        หากคุณเชื่อว่างานของคุณถูกคัดลอกและโพสต์ไว้บนบริการด้วยวิธีการที่เป็นการละเมิดลิขสิทธิ์
                        กรุณาส่งคำร้องแก่เราโดยใช้แบบฟอร์มที่นี่ หากคุณติดต่อเราด้วยเรื่องที่เกี่ยวกับการละเมิดลิขสิทธิ์
                        โปรดระบุถึงข้อมูลต่อไปนี้ :</p>
                    <p class="text-justify mt-1 indent-12 text-base">• ลายมือชื่ออิเล็กทรอนิกส์
                        หรือลายมือชื่อจริงของบุคคลผู้มีอำนาจกระทำการในนามของเจ้าของลิขสิทธิ์นั้นๆ</p>
                    <p class="text-justify mt-1 indent-12 text-base">•
                        คำอธิบายผลงานอันมีลิขสิทธิ์ที่คุณเชื่อว่าถูกละเมิด</p>
                    <p class="text-justify mt-1 indent-12 text-base">•
                        คำอธิบายรายละเอียดของตำแหน่งชิ้นงานที่คุณเชื่อว่าถูกละเมิดพร้อมระบุว่าอยู่ในส่วนใดของบริการนี้
                        (และคำบรรยายดังกล่าวต้องให้ข้อมูลตามสมควรที่จะทำให้เราสามารถค้นหาชิ้นงานซึ่งน่าสงสัยว่าเป็นการละเมิดสิทธิ์)
                    </p>
                    <p class="text-justify mt-1 indent-12 text-base">• ข้อมูลติดต่อของคุณ รวมถึงที่อยู่ หมายเลขโทรศัพท์
                        อีเมล และข้อมูลอัตลักษณ์ที่ระบุความเป็นเจ้าของลิขสิทธิ์</p>
                    <p class="text-justify mt-1 indent-12 text-base">•
                        การให้คำมั่นเป็นลายลักษณ์อักษรของคุณที่ระบุว่าคุณมีความเชื่อโดยสุจริตว่าการใช้งานดังกล่าวไม่ได้รับอนุญาตจากเจ้าของลิขสิทธิ์ตัวแทน
                        หรือกฎหมาย</p>
                    <p class="text-justify mt-1 indent-12 text-base">• คำแถลงของคุณ ที่ทำขึ้นภายใต้บทลงโทษการให้การเท็จ
                        ว่าข้อมูลข้างต้นในใบแจ้งของคุณนั้นถูกต้องทุกประการ
                        และคุณเป็นเจ้าของลิขสิทธิ์หรือผู้ได้รับอนุญาตให้กระทำการแทนเจ้าของลิขสิทธิ์</p>
                    <p class="text-justify mt-1 indent-10 text-base">ojo
                        จะดำเนินการปิดบัญชีของผู้ละเมิดลิขสิทธิ์ที่กระทำผิดซ้ำ</p>

                    <h3 class="text-justify mt-4 text-lg font-bold">12. ข้อจำกัดความรับผิดชอบ</h3>

                    <p class="text-justify mt-4 indent-10 text-base">ojo จัดหาบริการในลักษณะ “ตามที่เป็น” และ”ตามที่มี”
                        และภายใต้ขอบเขตสูงสุดของกฎหมายที่ใช้บังคับพึงอนุญาต ขอปฏิเสธการรับประกันในทุกประการ
                        ไม่ว่าโดยชัดแจ้ง โดยนัย โดยชอบด้วยกฎหมาย หรือไม่ว่าในกรณีอื่นใดที่เกี่ยวข้องกับบริการนี้
                        (รวมถึงเนื้อหาทั้งหมดที่ประกอบอยู่ในข้อตกลงนี้)
                        รวมถึงแต่ไม่จำกัดเฉพาะการรับประกันโดยนัยเกี่ยวกับความพึงพอใจในคุณภาพ
                        สภาพการใช้ประโยชน์ในเชิงพาณิชย์ ความเหมาะสมเพื่อวัตถุประสงค์ใดๆ
                        หรือการไม่ละเมิดสิทธิ์และกรรมสิทธิ์ ojo ไม่ได้รับรองหรือรับประกันว่า (ก)
                        บริการนี้จะราบรื่นไม่สะดุด ปลอดภัย หรือปราศจากข้อผิดพลาด (ข) ข้อบกพร่อง หรือข้อผิดพลาดใดๆ
                        ในบริการนี้จะได้รับการแก้ไข หรือ (ค) เนื้อหา หรือข้อมูลใดๆ ที่คุณได้รับจาก
                        หรือผ่านบริการนี้จะมีความถูกต้องแม่นยำ</p>
                    <p class="text-justify mt-4 indent-10 text-base">ojo จะไม่รับผิดชอบต่อคอนเทนท์ใดๆ
                        ที่คุณหรือสมาชิกท่านอื่นหรือบุคคลที่สามโพสท์ ส่ง หรือรับผ่านบริการ คอนเทนท์ใดๆ
                        ที่คุณเข้าถึงผ่านการดาวน์โหลดหรือได้รับมาผ่านการใช้บริการจะถือว่าขึ้นกับดุลยพินิจและเป็นความเสี่ยงของคุณเอง
                    </p>

                    <h3 class="text-justify mt-4 text-lg font-bold">13. บริการภายนอกต่างๆ</h3>

                    <p class="text-justify mt-4 indent-10 text-base">
                        บริการอาจจะมีเนื้อหาโฆษณาและการส่งเสริมการขายที่นำเสนอโดยบุคคลที่สาม
                        และมีลิงก์ไปยังเว็บไซต์หรือแหล่งข้อมูลอื่นๆ ทาง ojo ไม่รับผิดชอบต่อความพร้อมให้บริการ
                        (หรือการขาดความพร้อมในการให้บริการ) ของเว็บไซต์หรือแหล่งข้อมูลภายนอกดังกล่าว
                        หากคุณเลือกที่จะมีปฏิสัมพันธ์กับบุคคลที่สามที่มีผ่านบริการของเรา
                        เงื่อนไขของฝ่ายดังกล่าวจะกำกับควบคุมความสัมพันธ์ของตนที่มีกับคุณ ทาง ojo
                        ไม่รับผิดชอบหรือรับผิดต่อเงื่อนไขหรือการกระทำการของบุคคลที่สามดังกล่าว</p>

                    <h3 class="text-justify mt-4 text-lg font-bold">14. ข้อจำกัดความรับผิด</h3>

                    <p class="text-justify mt-4 indent-10 text-base">ตามขอบเขตสูงสุดที่กฎหมายที่บังคับใช้อนุญาตไว้
                        ไม่ว่าจะในกรณีในก็ตาม ทาง ojo, บริษัทในเครือ, พนักงาน, ผู้ออกใบอนุญาต หรือผู้ให้บริการของบริษัท
                        จะไม่รับผิดต่อความเสียหายที่เกิดขึ้นทางอ้อม ที่เป็นผลสืบเนื่อง ที่เป็นแบบอย่าง
                        ที่เกิดขึ้นโดยบังเอิญ ที่เป็นการเฉพาะ เป็นการลงโทษ หรือเป็นความเสียหายที่เพิ่มขึ้น
                        รวมถึงแต่ไม่จำกัดเพียงการสูญเสียผลกำไร ไม่ว่าจะเกิดขึ้นโดยทางตรงหรือทางอ้อม หรือการสูญเสียข้อมูล
                        การใช้งาน ค่าความนิยม หรือการสูญเสียที่จับต้องไม่ได้อื่นๆ อันเป็นผลมาจาก: (1)
                        การเข้าถึงหรือการใช้ หรือการไม่สามารถเข้าถึงหรือไม่สามารถใช้บริการโดยตัวคุณเอง (2)
                        การกระทำการหรือคอนเทนท์ของสมาชิกคนอื่นๆ หรือบุคคลที่สามเกี่ยวกับ ผ่าน
                        หรือที่เป็นผลสืบเนื่องจากการใช้บริการ หรือ (3) การเข้าถึง การใช้งาน
                        หรือการแก้ไขคอนเทนท์ของคุณโดยไม่ได้รับอนุญาต แม้ว่า ojo
                        จะได้รับแจ้งถึงโอกาสความเป็นไปได้ของความเสียหายดังกล่าวเมื่อเวลาใดๆ แล้วก็ตาม
                        ไม่ว่าในกรณีใดก็ตาม ความรับผิดโดยรวมของ ojo
                        ที่มีต่อคุณสำหรับข้อเรียกร้องทั้งหมดที่เกี่ยวข้องกับบริการจะต้องไม่เกินกว่าจำนวนเงินที่คุณจ่ายให้แก่
                        ojo</p>
                    <p class="text-justify mt-4 indent-10 text-base">ในบางเขตอำนาจศาลไม่อนุญาตให้มีข้อยกเว้น
                        หรือข้อจำกัดเกี่ยวกับค่าเสียหายบางประการ
                        ดังนั้นข้อยกเว้นและข้อจำกัดบางส่วนหรือทั้งหมดในมาตรานี้อาจไม่สามารถใช้บังคับกับคุณ</p>

                    <h3 class="text-justify mt-4 text-lg font-bold">15. สถานที่</h3>

                    <p class="text-justify mt-4 indent-10 text-base">
                        นอกจากสมาชิกที่พำนักอยู่ในสหภาพยุโรปหรือเขตเศรษฐกิจยุโรป
                        ซึ่งอาจนำข้อเรียกร้องไปใช้ในประเทศที่พำนักได้ตามกฎหมายที่บังคับใช้
                        และยกเว้นการเรียกร้องที่อาจนำไปสู่การฟ้องร้องในศาลเล็กที่อาจได้รับค่าเสียหายจากศาลขนาดเล็ก
                        การเรียกร้องทั้งหมดที่เกิดขึ้นจาก หรือเกี่ยวข้องกับข้อตกลงฉบับนี้ ต่อบริการ
                        หรือความสัมพันธ์ของคุณกับ ojo ว่าด้วยเหตุผลใดก็ตาม</p>

                    <h3 class="text-justify mt-4 text-lg font-bold">16. การชดใช้ค่าเสียหายโดยคุณ</h3>

                    <p class="text-justify mt-4 indent-10 text-base">ภายใต้ขอบเขตที่กฎหมายที่มีอนุญาตไว้
                        คุณยินยอมว่าจะชดใช้ ปกป้อง และไม่ฟ้องร้อง ojo บริษัทในเครือของเรา และเจ้าหน้าที่ ผู้บริหาร
                        ตัวแทน และพนักงานของบริษัทในเครือและของเรา จากการร้องเรียน การเรียกร้อง การฟ้องร้อง ความเสียหาย
                        การสูญเสีย ค่าใช้จ่าย ความรับผิด และค่าใช้จ่ายใดๆ เลย รวมถึงค่าธรรมเนียมทนายความ ที่มีเหตุมาจาก
                        เกิดขึ้นจาก หรือเกี่ยวข้องในทางใดทางหนึ่งกับการเข้าถึงหรือใช้บริการของคุณ คอนเทนท์ของคุณ
                        หรือการฝ่าฝืนข้อตกลงนี้ของคุณ</p>

                    <h3 class="text-justify mt-4 text-lg font-bold">17. ข้อตกลงเบ็ดเสร็จ และอื่นๆ</h3>

                    <p class="text-justify mt-4 indent-10 text-base">
                        ข้อตกลงนี้ที่ครอบคลุมนโยบายการคุ้มครองข้อมูลส่วนบุคคล, นโยบายการใช้คุกกี้,
                        เคล็ดลับเพื่อความปลอดภัย, หลักปฏิบัติของคอมมิวนิตี้ และกระบวนการอนุญาโตตุลาการ
                        (หากเกี่ยวข้องกับคุณ) รวมทั้งเงื่อนไขใดๆ ที่คุณได้รับแจ้งและยินยอมตกลง หากคุณซื้อฟีเจอร์
                        ผลิตภัณฑ์ หรือบริการที่เรานำเสนอไว้บนบริการเพิ่มเติม จะมีข้อตกลงเบ็ดเสร็จระหว่างคุณและ ojo
                        เกี่ยวกับการใช้บริการอยู่ หากข้อกำหนดใดของข้อตกลงฉบับนี้เป็นโมฆะ
                        คอนเทนท์ส่วนที่เหลือของข้อตกลงจะยังมีผลบังคับใช้อย่างเต็มที่และสมบูรณ์ทุกประการ
                        การที่บริษัทไม่สามารถใช้สิทธิ์หรือบังคับใช้สิทธิ์หรือข้อกำหนดใดๆ ในข้อตกลงฉบับนี้ได้
                        จะไม่ถือว่าเป็นการสละซึ่งสิทธิ์หรือข้อกำหนดดังกล่าว คุณยินยอมว่าบัญชี ojo ของคุณจะโอนย้ายไม่ได้
                        และสิทธิ์ทั้งหมดของคุณในบัญชีรวมถึงคอนเทนท์ในบัญชีจะสิ้นสุดลงเมื่อคุณเสียชีวิต
                        จะไม่มีการสร้างบริษัทตัวแทน ห้างหุ้นส่วน กิจการร่วมค้า
                        ผู้ดูแลผลประโยชน์หรือความสัมพันธ์พิเศษหรือการจ้างงานอื่นใดสืบเนื่องจากข้อตกลงฉบับนี้
                        และคุณไม่มีสิทธิให้คำรับรองในนามของ ojo หรือผูกมัด ojo ไม่ว่าจะเป็นในลักษณะใดก็ตาม</p>

                    <div class="form-check flex items-center">
                        <input class="form-check-input" type="checkbox" id="rememberMe"
                            onchange="document.getElementById('btSubmit').disabled = !this.checked;">
                        <label class="form-check-label ms-2 uppercase" for="rememberMe" disabled>accept</label>
                    </div>
                </div>
            </div>
        </div>


    </section>
    <footer class="fixed bottom-0">
        <button type="button" onclick="window.location.href = '{{ route('page.register') }}'" class="btn container bg-[#A894D0] text-white w-100 rounded-lg py-2 mt-2" id="btSubmit" onclick="document.location = 'signup.html'"
            disabled>Next</button>
    </footer>
</div>
@endsection
